app/controllers/concerts_controller.rb

SELECT "concerts".* FROM "concerts"
---
  def index
    @concerts = Concert.all

INSERT INTO "concerts" ("name", "location", "start_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Duke Dumont"], ["location", "Los Angeles"], ["start_time", "2016-09-23 02:36:00.000000"], ["created_at", "2016-09-13 02:36:48.951811"], ["updated_at", "2016-09-13 02:36:48.951811"]]
---
  def create
    @concert = Concert.new(concert_params)

    respond_to do |format|
      if @concert.save

UPDATE "concerts" SET "name" = ?, "location" = ?, "start_time" = ?, "updated_at" = ? WHERE "concerts"."id" = ?  [["name", "Duke Dumont"], ["location", "Los Angeles"], ["start_time", "2016-09-23 23:44:00.000000"], ["updated_at", "2016-09-13 02:20:14.955810"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @concert.update(concert_params)

DELETE FROM "concerts" WHERE "concerts"."id" = ?  [["id", 1]]
---
  def destroy
    @concert.destroy

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_concert
      @concert = Concert.find(params[:id])